[
    {
        "id": 1,
        "title": "Responsive and Mobile-First Design",
        "current": "Responsive design remains crucial, ensuring websites adapt to various devices. Mobile-first design prioritizes the mobile user experience.",
        "future": "Mobile-first design will continue to gain importance as mobile browsing surpasses desktop usage.",
        "image": "/trends/responsive.png"
    },
    {
        "id": 2,
        "title": "Progressive Web Apps (PWAs)",
        "current": "PWAs combine the best of web and app experiences, offering fast loading times and offline capabilities.",
        "future": "PWAs will become more prevalent as businesses seek app-like experiences without the need for app stores and downloads.",
        "image": "/trends/pwa.jpg"
    },
    {
        "id": 3,
        "title": "Web Accessibility",
        "current": "Web accessibility is gaining prominence, ensuring websites are usable by people with disabilities.",
        "future": "Accessibility standards will be further enforced, making inclusive web design a fundamental aspect of development.",
        "image": "/trends/web_accessibility.png"
    },
    {
        "id": 4,
        "title": "AI and Chatbots",
        "current": "AI-powered chatbots enhance user engagement and provide instant customer support.",
        "future": "AI integration will expand, enabling more advanced personalization, predictive analytics, and natural language interactions.",
        "image": "/trends/chatbot.png"
    },
    {
        "id": 5,
        "title": "Voice Search and Assistants",
        "current": "Voice search is changing SEO strategies, as users increasingly rely on voice assistants like Siri and Google Assistant.",
        "future": "Voice interfaces will become more prevalent, necessitating websites to optimize content for voice search and interaction.",
        "image": "/trends/voice_search.jpg"
    },
    {
        "id": 6,
        "title": "Motion UI and Microinteractions",
        "current": "Motion UI and microinteractions enhance user engagement and create visually appealing experiences.",
        "future": "More websites will incorporate subtle animations, transitions, and interactive elements to elevate user interactions.",
        "image": "/trends/motion_ui.jpg"
    },
    {
        "id": 7,
        "title": "Serverless Architecture",
        "current": "Serverless architecture reduces the need for traditional server management, allowing developers to focus on code.",
        "future": "Serverless computing will continue to evolve, offering more efficient and cost-effective ways to build and deploy applications.",
        "image": "/trends/serverless.jpg"
    },
    {
        "id": 8,
        "title": "Cybersecurity and Privacy Focus",
        "current": "Data breaches underscore the importance of cybersecurity and data privacy measures.",
        "future": "Stricter data protection regulations and increasing user concerns will drive enhanced cybersecurity practices.",
        "image": "/trends/cybersecurity.jpg"
    },
    {
        "id": 9,
        "title": "Web Components",
        "current": "Web components allow developers to create reusable and modular components across different frameworks.",
        "future": "Web components will become more standardized, enabling a more unified approach to component-based development.",
        "image": "/trends/web_components.png"
    },
    {
        "id": 10,
        "title": "Low-Code and No-Code Development",
        "current": "Low-code and no-code platforms empower non-developers to create applications with minimal coding.",
        "future": "These platforms will continue to evolve, enabling faster prototyping and application development.",
        "image": "/trends/low_code.jpg"
    },
    {
        "id": 11,
        "title": "3D and Immersive Experiences",
        "current": "3D graphics and virtual reality (VR) elements are being integrated into web experiences.",
        "future": "More websites will incorporate immersive technologies to provide engaging and interactive user experiences.",
        "image": "/trends/3d.jpg"
    },
    {
        "id": 12,
        "title": "Green Web Development",
        "current": "Green web development focuses on energy-efficient and sustainable practices.",
        "future": "Sustainable practices will become integral to web development, driven by the need for energy conservation.",
        "image": "/trends/green_web.jpg"
    }
]